In [1]:
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = 'all'

In [2]:
import numpy as np
import pandas as pd

## DataFrame loc

In [21]:
s1 = pd.Series([1,4,2,3,5], index=list('abcde'))

s1
s1.loc['c']
s1.iloc[1]

dic1 = {'a':[1,2,3],'b':[2,3,4,],'c':[3,4,5]}

df1 = pd.DataFrame( np.arange(16).reshape(4,4) , index=[10,20,30,40] , columns=list('abcd') , dtype=float)

df1
df1.loc[10,:]
df1.loc[10]

a    1
b    4
c    2
d    3
e    5
dtype: int64

2

4

       a     b     c     d
10   0.0   1.0   2.0   3.0
20   4.0   5.0   6.0   7.0
30   8.0   9.0  10.0  11.0
40  12.0  13.0  14.0  15.0

a    0.0
b    1.0
c    2.0
d    3.0
Name: 10, dtype: float64

a    0.0
b    1.0
c    2.0
d    3.0
Name: 10, dtype: float64

### loc [:] index 범위를 지정해서 특정범위만 출력가능

### [[]] [] 의 차이 = [[]] 는 각자 다른 dtype 이 가능하나 , [] 안은 dtype 이 통일이된다

In [27]:

df1.loc[10:30]

# 분할해서 사용가능 
df1.loc[[10,40]]

      a    b     c     d
10  0.0  1.0   2.0   3.0
20  4.0  5.0   6.0   7.0
30  8.0  9.0  10.0  11.0

       a     b     c     d
10   0.0   1.0   2.0   3.0
40  12.0  13.0  14.0  15.0

## DataFrame iloc

### [] 만 쓴다면 Series 로 나올수 있음 ,

In [36]:
df2 = pd.DataFrame( dic1 , index=['g','k','p'])

df2
df2.iloc[2]
df2.iloc[1:3]

print('#'*20)
df2.iloc[[2]]
df2.iloc[[0,2]]

   a  b  c
g  1  2  3
k  2  3  4
p  3  4  5

a    3
b    4
c    5
Name: p, dtype: int64

   a  b  c
k  2  3  4
p  3  4  5

####################

   a  b  c
p  3  4  5

   a  b  c
g  1  2  3
p  3  4  5

## iloc 로 head() , tail() 기능 구현가능

In [42]:
df3 = pd.read_table('C:\\Users\\Hyobin An\\workspace-Pandas\\pandas_data1.txt' , sep='\t' , engine='python' , index_col = '이름')

df3.index.name=None
df3.iloc[:4] # =df3.head(4)

     성별   학년    중간  기말  출석  과제
김둘   여자  1.0   NaN  36   5  75
김셋   남자  2.0  17.0  20   5  96
김여섯  남자  2.0  28.0  20   4  83
김일곱  남자  NaN  20.0  44   6  82

## loc 를 통해 특정 column 슬라이싱 가능

In [46]:
df3.loc[:,'중간'] # '중간만 가져오기'

김둘      NaN
김셋     17.0
김여섯    28.0
김일곱    20.0
김여덜    20.0
김아홉    23.0
김열     16.0
이다섯    21.0
이아홉    20.0
이열     28.0
박하나    30.0
박둘     20.0
박여섯    24.0
김하나    19.0
박열     23.0
최하나    29.0
최둘     18.0
최셋     29.0
이여섯    22.0
이일곱    24.0
이여덜    17.0
최여덜    13.0
최아홉    21.0
최열     16.0
김넷     18.0
김다섯    24.0
이하나    29.0
이둘     30.0
이셋     22.0
이넷     24.0
Name: 중간, dtype: float64

In [51]:
df3.iloc[:,2] # iloc 로 슬라이싱으로 대체 가능

김둘      NaN
김셋     17.0
김여섯    28.0
김일곱    20.0
김여덜    20.0
김아홉    23.0
김열     16.0
이다섯    21.0
이아홉    20.0
이열     28.0
박하나    30.0
박둘     20.0
박여섯    24.0
김하나    19.0
박열     23.0
최하나    29.0
최둘     18.0
최셋     29.0
이여섯    22.0
이일곱    24.0
이여덜    17.0
최여덜    13.0
최아홉    21.0
최열     16.0
김넷     18.0
김다섯    24.0
이하나    29.0
이둘     30.0
이셋     22.0
이넷     24.0
Name: 중간, dtype: float64

In [54]:
df3['기말'] # 기말만 가져오기 ( 1개만 선택한 경우)

김둘     36
김셋     20
김여섯    20
김일곱    44
김여덜    24
김아홉    45
김열     47
이다섯    35
이아홉    36
이열     41
박하나    25
박둘     31
박여섯    37
김하나    18
박열     20
최하나    39
최둘     29
최셋     39
이여섯    38
이일곱    32
이여덜    47
최여덜    48
최아홉    33
최열     50
김넷     28
김다섯    18
이하나    17
이둘     42
이셋     50
이넷     21
Name: 기말, dtype: int64

In [57]:
df3.loc[:,:'기말'].head()
df3.iloc[:,:4].head()

      성별   학년    중간  기말
김둘    여자  1.0   NaN  36
김셋    남자  2.0  17.0  20
김여섯   남자  2.0  28.0  20
김일곱   남자  NaN  20.0  44
김여덜  NaN  1.0  20.0  24

      성별   학년    중간  기말
김둘    여자  1.0   NaN  36
김셋    남자  2.0  17.0  20
김여섯   남자  2.0  28.0  20
김일곱   남자  NaN  20.0  44
김여덜  NaN  1.0  20.0  24

## loc[ 전체행:    , [ 일부열] ]
## iloc[ 전체행 :  , [ 일부열 슬라이싱 ] ]

In [62]:
df3.loc[:,['성별','학년','기말']].head()
#df3.iloc[:,[0,1,3]].head()

      성별   학년  기말
김둘    여자  1.0  36
김셋    남자  2.0  20
김여섯   남자  2.0  20
김일곱   남자  NaN  44
김여덜  NaN  1.0  24

In [68]:
df3[['학년','기말']].head()  # 간소화 가능

      학년  기말
김둘   1.0  36
김셋   2.0  20
김여섯  2.0  20
김일곱  NaN  44
김여덜  1.0  24

## 실습 3

    - 1. 처음부터 '김열' 학생의 데이터를 가져와라
    - 2. 최하나 학생의 기말점수 는?
    - 3. 김다섯 학생의 모든점수를 Series , DataFrame 으로 
    - 4. 처음 7명의 모든 학년정보
    - 5. 이여섯, 최아홉 의 학생의 중간부터 출석정보
    - 6. 마지막 5명 학생의 출석 과제점수

In [102]:
# # #1
# # df3.loc[:'김열']
# # #2
# # df3.loc['최하나','기말']
# # #3
# # df3.loc['김다섯']
# # df3.loc[['김다섯']]
# #4 
# df3.iloc[:7]['학년']
# #5
# df3.loc[['이여섯','최아홉'],'중간':'출석']
# #6
df3.iloc[-5:][['출석']]

     출석
김다섯   6
이하나   5
이둘    8
이셋    4
이넷   10